---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeRoofFromVerticalFaceError
source: html/7f490d98-c926-6309-825c-7ba941e80fb7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeRoofFromVerticalFaceError Property

Can't make roof from vertical face.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeRoofFromVerticalFaceError { get; }
```